# Pandas

In [1]:
import pandas as pd

In [2]:
d=[1,2,3,4,5]
i=['D1','D2','D3','D4','D5']

In [3]:
s=pd.Series(d,index=i)

In [4]:
s

D1    1
D2    2
D3    3
D4    4
D5    5
dtype: int64

In [5]:
d1=[['Neelash',21],['Hari',20]]

In [6]:
df=pd.DataFrame(d1,columns=['Name','Age'],index=['Data1','Data2'])

In [7]:
print(df)

          Name  Age
Data1  Neelash   21
Data2     Hari   20

In [8]:
df

          Name  Age
Data1  Neelash   21
Data2     Hari   20

In [9]:
d2={'Name':['Neelash'],'Age':'21'}
d3={'Name':['Neelash','Hari'],'Age':[21,20]}

In [10]:
df1=pd.Series(d2)

In [11]:
df1

Name    [Neelash]
Age            21
dtype: object

In [12]:
df2=pd.DataFrame(d3)

In [13]:
df2

      Name  Age
0  Neelash   21
1     Hari   20

In [14]:
df2['Name']

0    Neelash
1       Hari
Name: Name, dtype: object

In [15]:
df2.head(2)

      Name  Age
0  Neelash   21
1     Hari   20

In [16]:
df2.iloc[0]

Name    Neelash
Age          21
Name: 0, dtype: object

In [17]:
df2.iloc[0,0:1]

Name    Neelash
Name: 0, dtype: object

In [18]:
df2.iloc[0:,0:2].values

array([['Neelash', 21],
       ['Hari', 20]], dtype=object)

In [19]:
df2.mean()

Age    20.5
dtype: float64

In [20]:
df2.median()

Age    20.5
dtype: float64